{
  "title": "Une roadmap of Web Applications on Mobile",
  "discourse": {
    "category": "W3C’s discourse forum",
  },
  "pages": [
    {
      "title": "Des graphiques et des hommes",
      "description": "Features needed to design compelling and smooth user interfaces."
    },
    {
      "title": "Device Adaptation",
      "description": "Features needed to create responsive layouts, where content automatically adjusts itself to heterogeneous screens, input mechanisms and other device capabilities."
    },
    {
      "title": "Forms",
      "description": "Features needed to build rich forms and optimize user input on devices where text input remains a challenge."
    },
    {
      "title": "Data Storage",
      "description": "Technologies available to save state, export content, and integrate data from files and services on the system."
    },
    {
      "title": "Media",
      "description": "Features needed to create immersive audio/video experiences on mobile devices."
    },
    {
      "title": "User Input",
      "description": "Features needed to engage the user through device-specific interaction mechanisms, such as touch-based interactions, vibration, notifications."
    },
    {
      "title": "Sensors and Local Interactions",
      "description": "Hooks to interact with sensors that compose mobile devices, from accelerometers and geolocation sensors to proximity-based communication mechanisms."
    },
    {
      "title": "Network and Communications",
      "description": "Interactions with the network to bring the power and immense storage capabilities of the Web to otherwise limited mobile devices."
    },
    {
      "title": "Application Lifecycle",
      "description": "Mechanisms to integrate the application with the rest of the system and provide a native-like experience."
    },
    {
      "title": "Payment and Services",
      "description": "Features needed to monetize an application, e.g. by integrating easy-to-use in-app purchases."
    },
    {
      "title": "Performance and Tuning",
      "description": "Mechanisms to monitor and improve the performances of an application on highly-constrained mobile devices."
    },
    {
      "title": "Security and Privacy",
      "description": "Technologies and considerations to guarantee privacy and security on mobile devices that hold some of the user’s most private and confidential data."
    }
  ]
}
